---
kind: property
id: P:Autodesk.Revit.DB.Architecture.BalusterInfo.TopOffset
source: html/e134ac97-52bb-6c3a-4351-8d169747ee1e.htm
---
# Autodesk.Revit.DB.Architecture.BalusterInfo.TopOffset Property

The offset from the top reference.

## Syntax (C#)
```csharp
public double TopOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for topOffset must be no more than 30000 feet in absolute value.